{
  "organs": [
    {
      "id": "lungs",
      "name": "Pulmões",
      "system": "Respiratório",
      "svgId": "organ-lungs",
      "weight": 0.18,
      "metrics": ["oxygen_uptake", "cilia_health", "inflammation"],
      "narration": {
        "what_happens": "O tabagismo deposita alcatrão e mais de 70 carcinógenos conhecidos nos pulmões, danifica os cílios respiratórios e causa inflamação crónica. Fumadores têm 15-30 vezes maior risco de cancro do pulmão. Globalmente, a DPOC afeta 12.64% dos adultos com mais de 40 anos (meta-análise BMC 2024), com projeções de atingir 600 milhões de casos até 2050. Nos EUA, 4.2% dos adultos têm diagnóstico de DPOC.",
        "what_helps": "Parar de fumar permite recuperação parcial: os cílios começam a regenerar-se em 1-2 semanas, e o risco de cancro diminui gradualmente ao longo de 10-15 anos. Exercício aeróbico regular (150 min/semana conforme OMS) melhora a capacidade pulmonar e eficiência do intercâmbio gasoso. Apenas 46.9% dos adultos americanos cumprem as diretrizes de atividade física aeróbica."
      },
      "healthyColor": "#ff9999",
      "affectedColor": "#cc3333"
    },
    {
      "id": "heart",
      "name": "Coração",
      "system": "Cardiovascular",
      "svgId": "organ-heart",
      "weight": 0.20,
      "metrics": ["blood_pressure", "rhythm", "arterial_health"],
      "narration": {
        "what_happens": "As doenças cardiovasculares causam 32% de todas as mortes globais (17.9 milhões/ano, OMS 2024). O tabagismo aumenta o risco de enfarte em 2-4 vezes; fumadores atuais têm risco 5x maior (meta-análise JAMA 2024). Nos EUA, 1 em 20 adultos (5%) tem doença coronária. O comportamento sedentário (>8h sentado/dia) aumenta mortalidade cardiovascular em 32%. A inatividade física afeta 31% dos adultos globalmente.",
        "what_helps": "Exercício aeróbico regular reduz pressão arterial em 5-10 mmHg e fortalece o músculo cardíaco. A dieta mediterrânica reduz eventos cardiovasculares em 30% (estudo PREDIMED). Parar de fumar reduz o risco de doença cardíaca em 50% após 1 ano. Apenas 24.2% dos adultos americanos cumprem diretrizes de exercício aeróbico e força."
      },
      "healthyColor": "#ff6b6b",
      "affectedColor": "#cc1f1f"
    },
    {
      "id": "brain",
      "name": "Cérebro",
      "system": "Nervoso",
      "svgId": "organ-brain",
      "weight": 0.22,
      "metrics": ["cognitive_function", "mood", "neuroplasticity"],
      "narration": {
        "what_happens": "Depressão afeta 21.4% dos adultos americanos (1 em 5, CDC 2024); ansiedade afeta 19.1%. Globalmente, 5.7% dos adultos sofrem de depressão. O consumo excessivo de álcool reduz volume cerebral em 1-2%. Após 65 anos, 40% experimentam alguma perda de memória; 1 em 9 americanos 65+ têm Alzheimer (7.2 milhões em 2025). Má qualidade de sono afeta 35% dos adultos (CDC), com 14.5% tendo dificuldade em adormecer.",
        "what_helps": "Exercício físico aumenta BDNF em 15-30% e promove neurogénese. Sono adequado (7-9h) é essencial - 35% dos adultos dormem menos de 7h. Meditação pode aumentar densidade da matéria cinzenta. Exercício regular beneficia apenas 46.9% dos adultos que cumprem diretrizes. Estimulação cognitiva mantém reserva cognitiva e pode atrasar declínio."
      },
      "healthyColor": "#ffa8a8",
      "affectedColor": "#cc4444"
    },
    {
      "id": "liver",
      "name": "Fígado",
      "system": "Digestivo",
      "svgId": "organ-liver",
      "weight": 0.16,
      "metrics": ["detoxification", "metabolism", "inflammation"],
      "narration": {
        "what_happens": "Doença hepática relacionada com álcool afeta 4.8% globalmente (meta-análise 2024); cirrose alcoólica representa 32.9% dos casos. Mortalidade é de 23.9%. Nos EUA, mortes por cirrose alcoólica triplicaram entre 1999-2019. Doença hepática não alcoólica (NAFLD) afeta 25-30% da população adulta global. Álcool está associado a 25% das mortes globais por cirrose. Mesmo 2-3 bebidas diárias causam danos mensuráveis.",
        "what_helps": "O fígado pode regenerar até 75% do seu tecido quando fatores de dano são removidos. Reduzir álcool permite recuperação em 2-4 semanas. Exercício regular reduz gordura hepática em 20-30% e melhora sensibilidade à insulina. Perda de 7-10% do peso corporal pode reverter esteatose. Dieta rica em antioxidantes e fibras apoia desintoxicação."
      },
      "healthyColor": "#cc7a5c",
      "affectedColor": "#994433"
    },
    {
      "id": "kidneys",
      "name": "Rins",
      "system": "Urinário",
      "svgId": "organ-kidneys",
      "weight": 0.12,
      "metrics": ["filtration", "blood_pressure_control", "electrolyte_balance"],
      "narration": {
        "what_happens": "Hipertensão não controlada é a segunda causa principal de insuficiência renal. Globalmente, 537 milhões têm diabetes (10.5% da população, IDF 2021), projetado para 783 milhões até 2045. Diabetes causa nefropatia em 20-40% dos casos. Síndrome metabólica afeta 25-34% dos adultos americanos, triplicando o risco renal. Desidratação crónica e excesso de sódio sobrecarregam função renal.",
        "what_helps": "Hidratação adequada (1.5-2L/dia) mantém função renal ótima e previne cálculos. Controlo da pressão arterial (<130/80 mmHg) é crucial. Dieta baixa em sódio (<2.3g/dia) reduz carga renal. Exercício regular ajuda controlar pressão e diabetes. Apenas 46.9% dos adultos cumprem diretrizes de exercício, mas benefícios para rins são significativos."
      },
      "healthyColor": "#8B4513",
      "affectedColor": "#654321"
    },
    {
      "id": "gut",
      "name": "Intestino",
      "system": "Digestivo",
      "svgId": "organ-gut",
      "weight": 0.14,
      "metrics": ["microbiome_diversity", "barrier_function", "inflammation"],
      "narration": {
        "what_happens": "Doenças inflamatórias intestinais (DII) afetam 2.4-3.1 milhões nos EUA. Doenças inflamatórias imunomediadas afetam 5-7% da sociedade ocidental. Inflamação crónica sistémica afeta 34.6% dos adultos americanos (estudo 2024). Dietas ocidentais reduzem diversidade microbiana em 25-40%. Stress crónico altera eixo intestino-cérebro, aumentando permeabilidade intestinal e inflamação sistémica.",
        "what_helps": "Fibras prebióticas (25-35g/dia) alimentam bactérias benéficas e aumentam diversidade. Alimentos fermentados fornecem probióticos vivos. Exercício regular aumenta diversidade microbiana e motilidade - mas apenas 46.9% dos adultos cumprem diretrizes. Gestão do stress melhora comunicação intestino-cérebro. Evitar ultraprocessados protege microbioma."
      },
      "healthyColor": "#DEB887",
      "affectedColor": "#CD853F"
    },
    {
      "id": "skin",
      "name": "Pele",
      "system": "Tegumentar",
      "svgId": "organ-skin",
      "weight": 0.08,
      "metrics": ["hydration", "elasticity", "inflammation"],
      "narration": {
        "what_happens": "O tabagismo reduz o fluxo sanguíneo cutâneo em até 40%, acelera a degradação do colagénio e elastina, causando envelhecimento precoce e rugas. A exposição solar excessiva causa danos no ADN das células da pele e aumenta o risco de cancro cutâneo. O stress crónico pode agravar condições inflamatórias como eczema e psoríase através de mecanismos neuro-imunológicos.",
        "what_helps": "Proteção solar adequada (FPS 30+) previne 80% dos sinais de envelhecimento cutâneo. Hidratação adequada mantém a função de barreira da pele. Dieta rica em antioxidantes (vitaminas C, E, carotenoides) protege contra danos dos radicais livres. Sono adequado permite reparação celular - estudos mostram que privação de sono acelera sinais de envelhecimento cutâneo."
      },
      "healthyColor": "#FDBCB4",
      "affectedColor": "#E6967A"
    },
    {
      "id": "bladder",
    "name": "Bexiga",
    "system": "Urinário",
    "svgId": "organ-bladder",
    "weight": 0.06,
    "metrics": ["capacity", "control", "infection_resistance"],
    "narration": {
      "what_happens": "A desidratação crónica concentra a urina, irritando a parede da bexiga e aumentando o risco de infeções urinárias em 3-5 vezes. O stress crónico pode causar bexiga hiperativa através da disfunção do sistema nervoso autónomo. O álcool atua como diurético e irritante, causando urgência urinária e interrupção do sono. Estudos mostram que o consumo excessivo de cafeína pode aumentar a frequência urinária em 20-30%.",
      "what_helps": "Hidratação adequada (1.5-2L/dia) dilui a urina e reduz irritação da bexiga. Exercícios do pavimento pélvico (Kegel) fortalecem os músculos de controlo urinário e podem reduzir incontinência em 60-70% dos casos. Evitar irritantes como álcool, cafeína em excesso e alimentos ácidos melhora os sintomas de bexiga hiperativa. Técnicas de gestão de stress reduzem a urgência urinária relacionada com ansiedade."
    },
    "healthyColor": "#FFE4B5",
    "affectedColor": "#DEB887"
  },
  {
    "id": "liver",
    "name": "Fígado",
    "system": "Digestivo",
    "svgId": "organ-liver-new",
    "weight": 0.18,
    "metrics": ["detoxification", "metabolism", "regeneration"],
    "narration": {
      "what_happens": "Doença hepática relacionada com álcool afeta 4.8% globalmente (meta-análise 2024); cirrose alcoólica representa 32.9% dos casos com mortalidade de 23.9%. Nos EUA, mortes por cirrose alcoólica triplicaram entre 1999-2019. NAFLD afeta 25-30% da população adulta global. Álcool está associado a 25% das mortes globais por cirrose e 20% das mortes por cancro hepático. Mesmo 2-3 bebidas diárias causam danos mensuráveis.",
      "what_helps": "O fígado pode regenerar até 75% do seu tecido. Reduzir álcool permite recuperação significativa em 2-4 semanas. Exercício regular reduz gordura hepática em 20-30% e melhora sensibilidade à insulina. Perda de 7-10% do peso corporal pode reverter esteatose. Dieta rica em antioxidantes (vitaminas C, E, selénio) e fibras apoia desintoxicação. Apenas 46.9% dos adultos cumprem diretrizes de exercício."
    },
    "healthyColor": "#CD853F",
    "affectedColor": "#8B4513"
  }
  ]
}